In [1]:
!pip install sqlalchemy==1.3.2

In [ ]:
import sqlalchemy

In [ ]:
%load_ext sql

In [ ]:
%sql postgresql://choyoura:Choyoura!1@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: choyoura@dev'

In [ ]:
%%sql

DROP TABLE IF EXISTS choyoura.nps;
CREATE TABLE choyoura.nps (
    id INT NOT NULL primary key,
    created_at timestamp,
    score smallint
);

 * postgresql://choyoura:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql


SELECT table_name
FROM INFORMATION_SCHEMA.tables
WHERE table_schema = 'choyoura';

 * postgresql://choyoura:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
18 rows affected.

[('nps_summary',),
 ('nps',),
 ('weather_forecast',),
 ('name_gender',),
 ('cohort_table',),
 ('nps_group_table',),
 ('order_item_cleaned',),
 ('order_cleaned',),
 ('alert',),
 ('vital',),
 ('monthly_user_transaction_summary',),
 ('last_channel',),
 ('first_channel',),
 ('usc_st',),
 ('test_table',),
 ('test_channel',),
 ('test_boolean',),
 ('test_null',)]

NPS Data is copied from S3 by Airflow

In [ ]:
%%sql

select id, score, created_at from nps limit 10;

 * postgresql://choyoura:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(2, 9, datetime.datetime(2019, 1, 2, 3, 47, 26)),
 (4, 10, datetime.datetime(2019, 1, 4, 5, 2, 11)),
 (6, 2, datetime.datetime(2019, 1, 4, 23, 6, 18)),
 (8, 2, datetime.datetime(2019, 1, 5, 9, 26, 13)),
 (10, 10, datetime.datetime(2019, 1, 6, 13, 22, 47)),
 (12, 4, datetime.datetime(2019, 1, 6, 6, 9, 47)),
 (14, 2, datetime.datetime(2019, 1, 6, 2, 33, 32)),
 (16, 1, datetime.datetime(2019, 1, 7, 2, 38, 46)),
 (18, 1, datetime.datetime(2019, 1, 7, 7, 1, 43)),
 (20, 10, datetime.datetime(2019, 1, 7, 18, 33, 59))]

##### NPS Summary table



```sql
CREATE TABLE choyoura.temp_nps AS
SELECT LEFT(created_at, 7) AS month,               
       ROUND(SUM(CASE WHEN score >= 9 THEN 1
                     WHEN score <= 6 THEN -1 END)::float*100/COUNT(1), 2)
       FROM raw_data.nps
       GROUP BY 1
       ORDER BY 1;
ALTER TABLE choyoura.temp_nps RENAME to nps_summary;
```

In [ ]:
%%sql

select * from nps_summary order by month;

 * postgresql://choyoura:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
12 rows affected.

[('2019-01', 2.36),
 ('2019-02', 30.54),
 ('2019-03', 52.91),
 ('2019-04', 53.0),
 ('2019-05', 54.52),
 ('2019-06', 65.02),
 ('2019-07', 64.51),
 ('2019-08', 67.71),
 ('2019-09', 37.95),
 ('2019-10', 53.29),
 ('2019-11', 61.29),
 ('2019-12', 65.99)]